# Площадь
# Пользователь вводит стороны прямоугольника, выведите его площадь
print("Введите первую сторону прямоугольника: ")
a = int (input())
b = int (input("Введите вторую сторону прямоугольника: "))
print(a*b)