# Одинаковаяф четность
# Даны два целых числа: А, В. Проверить истинность выцсказыванияЖ "Числа А и В имеют одинаковую четность".

a = int (input("Введите первое число: "))
b = int (input("Введите второе число: "))

print(a%2 == b%2)
