# Одно положительное
#Даны три целых числа: А, В, С. Проверьте истинность высказывания: "Хотя бы одно из чисел А, В. С положительное"
a = int (input())
b = int (input())
c = int (input())

print(a>0 or b>0 or c>0)
